In [1]:
people = {
    'first': ['Rishabh', 'Shevi', 'Shubham', 'Shivam'],
    'last': ['Gupta', 'Gupta', 'Singh', 'Deshwal'],
    'email': ['gupta.rishabh2912@gmail.com', 'smileshelvi@gmail.com', 'shubham@gmail.com', 'deshwal.shivam@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

     first     last                        email
0  Rishabh    Gupta  gupta.rishabh2912@gmail.com
1    Shevi    Gupta        smileshelvi@gmail.com
2  Shubham    Singh            shubham@gmail.com
3   Shivam  Deshwal     deshwal.shivam@gmail.com

In [5]:
df['email']

0    gupta.rishabh2912@gmail.com
1          smileshelvi@gmail.com
2              shubham@gmail.com
3       deshwal.shivam@gmail.com
Name: email, dtype: object

In [6]:
df.set_index('email')

                               first     last
email
gupta.rishabh2912@gmail.com  Rishabh    Gupta
smileshelvi@gmail.com          Shevi    Gupta
shubham@gmail.com            Shubham    Singh
deshwal.shivam@gmail.com      Shivam  Deshwal

In [7]:
df #pandas didn't modified the index value

     first     last                        email
0  Rishabh    Gupta  gupta.rishabh2912@gmail.com
1    Shevi    Gupta        smileshelvi@gmail.com
2  Shubham    Singh            shubham@gmail.com
3   Shivam  Deshwal     deshwal.shivam@gmail.com

In [8]:
df.set_index('email', inplace=True) #to modify the index set inplace=True

In [9]:
df

                               first     last
email
gupta.rishabh2912@gmail.com  Rishabh    Gupta
smileshelvi@gmail.com          Shevi    Gupta
shubham@gmail.com            Shubham    Singh
deshwal.shivam@gmail.com      Shivam  Deshwal

In [10]:
df.index

Index(['gupta.rishabh2912@gmail.com', 'smileshelvi@gmail.com',
       'shubham@gmail.com', 'deshwal.shivam@gmail.com'],
      dtype='object', name='email')

In [11]:
df.loc['gupta.rishabh2912@gmail.com']

first    Rishabh
last       Gupta
Name: gupta.rishabh2912@gmail.com, dtype: object

In [12]:
df.loc['gupta.rishabh2912@gmail.com', 'last']

'Gupta'

In [13]:
df.iloc[0]

first    Rishabh
last       Gupta
Name: gupta.rishabh2912@gmail.com, dtype: object

In [14]:
df.reset_index(inplace=True)

In [15]:
filt = (df['last'] == 'Gupta')

In [16]:
df[filt] # directly filtered

                         email    first   last
0  gupta.rishabh2912@gmail.com  Rishabh  Gupta
1        smileshelvi@gmail.com    Shevi  Gupta

In [17]:
df.loc[filt] #we can use also loc also to filter (Better method)

                         email    first   last
0  gupta.rishabh2912@gmail.com  Rishabh  Gupta
1        smileshelvi@gmail.com    Shevi  Gupta

In [18]:
df.loc[filt,'email'] #we can use also loc also to filter 
#and we also pass in second argument to get a specific column

0    gupta.rishabh2912@gmail.com
1          smileshelvi@gmail.com
Name: email, dtype: object

In [19]:
filt = (df['last'] == 'Gupta') & (df['first'] == 'Rishabh') #And (&)

In [20]:
df.loc[filt, 'email']

0    gupta.rishabh2912@gmail.com
Name: email, dtype: object

In [21]:
filt = (df['last'] == 'Gupta') | (df['first'] == 'Shivam') #OR (|)

In [22]:
df.loc[filt, 'email']

0    gupta.rishabh2912@gmail.com
1          smileshelvi@gmail.com
3       deshwal.shivam@gmail.com
Name: email, dtype: object

In [23]:
df.loc[~filt, 'email'] # NOT (~)

2    shubham@gmail.com
Name: email, dtype: object

In [24]:
df

                         email    first     last
0  gupta.rishabh2912@gmail.com  Rishabh    Gupta
1        smileshelvi@gmail.com    Shevi    Gupta
2            shubham@gmail.com  Shubham    Singh
3     deshwal.shivam@gmail.com   Shivam  Deshwal

In [25]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [26]:
df.columns = [ 'email', 'first_name', 'last_name']

In [27]:
df

                         email first_name last_name
0  gupta.rishabh2912@gmail.com    Rishabh     Gupta
1        smileshelvi@gmail.com      Shevi     Gupta
2            shubham@gmail.com    Shubham     Singh
3     deshwal.shivam@gmail.com     Shivam   Deshwal

In [28]:
df.columns = [x.upper() for x in df.columns]

In [29]:
df

                         EMAIL FIRST_NAME LAST_NAME
0  gupta.rishabh2912@gmail.com    Rishabh     Gupta
1        smileshelvi@gmail.com      Shevi     Gupta
2            shubham@gmail.com    Shubham     Singh
3     deshwal.shivam@gmail.com     Shivam   Deshwal

In [30]:
df.columns = df.columns.str.replace('_', ' ')
df

                         EMAIL FIRST NAME LAST NAME
0  gupta.rishabh2912@gmail.com    Rishabh     Gupta
1        smileshelvi@gmail.com      Shevi     Gupta
2            shubham@gmail.com    Shubham     Singh
3     deshwal.shivam@gmail.com     Shivam   Deshwal

In [31]:
df.columns = df.columns.str.replace(' ', '_')
df.columns = [x.lower() for x in df.columns]
df

                         email first_name last_name
0  gupta.rishabh2912@gmail.com    Rishabh     Gupta
1        smileshelvi@gmail.com      Shevi     Gupta
2            shubham@gmail.com    Shubham     Singh
3     deshwal.shivam@gmail.com     Shivam   Deshwal

In [32]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)
df

                         email    first     last
0  gupta.rishabh2912@gmail.com  Rishabh    Gupta
1        smileshelvi@gmail.com    Shevi    Gupta
2            shubham@gmail.com  Shubham    Singh
3     deshwal.shivam@gmail.com   Shivam  Deshwal

In [33]:
df.loc[1] = ['smileshelvi@gmail.com', 'Shelvi', 'Goli']
df

                         email    first     last
0  gupta.rishabh2912@gmail.com  Rishabh    Gupta
1        smileshelvi@gmail.com   Shelvi     Goli
2            shubham@gmail.com  Shubham    Singh
3     deshwal.shivam@gmail.com   Shivam  Deshwal

In [34]:
df.loc[1, ['last', 'email']] = ['Garg', 'garg.shelvi@gmail.com']
df

                         email    first     last
0  gupta.rishabh2912@gmail.com  Rishabh    Gupta
1        garg.shelvi@gmail.com   Shelvi     Garg
2            shubham@gmail.com  Shubham    Singh
3     deshwal.shivam@gmail.com   Shivam  Deshwal

In [35]:
df.loc[df['last'] == 'Singh', 'email'] = 'shubham786@gmail.com'
df

                         email    first     last
0  gupta.rishabh2912@gmail.com  Rishabh    Gupta
1        garg.shelvi@gmail.com   Shelvi     Garg
2         shubham786@gmail.com  Shubham    Singh
3     deshwal.shivam@gmail.com   Shivam  Deshwal

In [36]:
df.loc[3, 'email'] = 'corner@esports.com'
df.loc[3]

email    corner@esports.com
first                Shivam
last                Deshwal
Name: 3, dtype: object

In [37]:
df.at[0, 'first'] = 'Rapid' # df.at() and df.loc or df.iloc works similarly in editing data
df # But df.loc() and df.iloc() is mostly used

                         email    first     last
0  gupta.rishabh2912@gmail.com    Rapid    Gupta
1        garg.shelvi@gmail.com   Shelvi     Garg
2         shubham786@gmail.com  Shubham    Singh
3           corner@esports.com   Shivam  Deshwal

In [38]:
filt = (df['email'] == 'corner@esports.com')
df[filt]['last'] = 'Deshu' # Always use df.loc() or df.at() to change values

C:\Users\RAPID\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [39]:
filt = (df['email'] == 'corner@esports.com')
df.loc[filt, 'last'] = 'Deshu'
df

                         email    first   last
0  gupta.rishabh2912@gmail.com    Rapid  Gupta
1        garg.shelvi@gmail.com   Shelvi   Garg
2         shubham786@gmail.com  Shubham  Singh
3           corner@esports.com   Shivam  Deshu

In [40]:
df['first'] = df['first'].str.upper()
df['last'] = df['last'].str.lower()
df

                         email    first   last
0  gupta.rishabh2912@gmail.com    RAPID  gupta
1        garg.shelvi@gmail.com   SHELVI   garg
2         shubham786@gmail.com  SHUBHAM  singh
3           corner@esports.com   SHIVAM  deshu

In [41]:
#apply 
#map
#applymap       (4 popular method to change values)
#replace

In [42]:
#apply

df['email'].apply(len) #passing function as arg NO "()"

0    27
1    21
2    20
3    18
Name: email, dtype: int64

In [43]:
def update_email(email):
    return email.upper()

In [44]:
df['email'].apply(update_email)  #passing function as arg [NO "()"]

0    GUPTA.RISHABH2912@GMAIL.COM
1          GARG.SHELVI@GMAIL.COM
2           SHUBHAM786@GMAIL.COM
3             CORNER@ESPORTS.COM
Name: email, dtype: object

In [45]:
df['email'] = df['email'].apply(update_email) 
df

                         email    first   last
0  GUPTA.RISHABH2912@GMAIL.COM    RAPID  gupta
1        GARG.SHELVI@GMAIL.COM   SHELVI   garg
2         SHUBHAM786@GMAIL.COM  SHUBHAM  singh
3           CORNER@ESPORTS.COM   SHIVAM  deshu

In [46]:
df['last'] = df['last'].apply(lambda x: x.upper()) #mostly lamda functions is used for small changes
df

                         email    first   last
0  GUPTA.RISHABH2912@GMAIL.COM    RAPID  GUPTA
1        GARG.SHELVI@GMAIL.COM   SHELVI   GARG
2         SHUBHAM786@GMAIL.COM  SHUBHAM  SINGH
3           CORNER@ESPORTS.COM   SHIVAM  DESHU

In [47]:
df['email'].apply(len)

0    27
1    21
2    20
3    18
Name: email, dtype: int64

In [48]:
df.apply(len, axis='columns') #giving length of number of rows(default) or columns

0    3
1    3
2    3
3    3
dtype: int64

In [49]:
len(df['email'])

4

In [50]:
df.apply(pd.Series.min)

email    CORNER@ESPORTS.COM
first                 RAPID
last                  DESHU
dtype: object

In [51]:
df.apply(lambda x: x.min())

email    CORNER@ESPORTS.COM
first                 RAPID
last                  DESHU
dtype: object

In [52]:
df.applymap(len) #make changes on every element applymap()

   email  first  last
0     27      5     5
1     21      6     4
2     20      7     5
3     18      6     5

In [53]:
df = df.applymap(str.lower)
df

                         email    first   last
0  gupta.rishabh2912@gmail.com    rapid  gupta
1        garg.shelvi@gmail.com   shelvi   garg
2         shubham786@gmail.com  shubham  singh
3           corner@esports.com   shivam  deshu

In [54]:
df['first'].map({'rapid': 'Rishabh', 'shelvi': 'Paaro'})

0    Rishabh
1      Paaro
2        NaN
3        NaN
Name: first, dtype: object

In [55]:
df['first'] = df['first'].replace({'rapid': 'Rishabh', 'shelvi': 'Paaro'})
df

                         email    first   last
0  gupta.rishabh2912@gmail.com  Rishabh  gupta
1        garg.shelvi@gmail.com    Paaro   garg
2         shubham786@gmail.com  shubham  singh
3           corner@esports.com   shivam  deshu

In [56]:
df['first'] + ' ' + df['last']

0    Rishabh gupta
1       Paaro garg
2    shubham singh
3     shivam deshu
dtype: object

In [57]:
df['full_name'] = df['first'] + ' ' + df['last']

In [58]:
df

                         email    first   last      full_name
0  gupta.rishabh2912@gmail.com  Rishabh  gupta  Rishabh gupta
1        garg.shelvi@gmail.com    Paaro   garg     Paaro garg
2         shubham786@gmail.com  shubham  singh  shubham singh
3           corner@esports.com   shivam  deshu   shivam deshu

In [59]:
df.drop(columns=['first', 'last'], inplace=True)

In [60]:
df

                         email      full_name
0  gupta.rishabh2912@gmail.com  Rishabh gupta
1        garg.shelvi@gmail.com     Paaro garg
2         shubham786@gmail.com  shubham singh
3           corner@esports.com   shivam deshu

In [61]:
df['full_name'].str.split(' ')

0    [Rishabh, gupta]
1       [Paaro, garg]
2    [shubham, singh]
3     [shivam, deshu]
Name: full_name, dtype: object

In [62]:
df['full_name'].str.split(' ', expand=True)

         0      1
0  Rishabh  gupta
1    Paaro   garg
2  shubham  singh
3   shivam  deshu

In [63]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [64]:
df

                         email      full_name    first   last
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh  gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro   garg
2         shubham786@gmail.com  shubham singh  shubham  singh
3           corner@esports.com   shivam deshu   shivam  deshu

In [65]:
df.append({'first': 'Vaibhav'}, ignore_index=True)

                         email      full_name    first   last
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh  gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro   garg
2         shubham786@gmail.com  shubham singh  shubham  singh
3           corner@esports.com   shivam deshu   shivam  deshu
4                          NaN            NaN  Vaibhav    NaN

In [66]:
people = {
    'first': ['Tony', 'Steve'],
    'last': ['Stark', 'Rogers'],
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [67]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [68]:
df.append(df2, ignore_index=True)

                         email      full_name    first    last
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh   gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro    garg
2         shubham786@gmail.com  shubham singh  shubham   singh
3           corner@esports.com   shivam deshu   shivam   deshu
4           IronMan@avenge.com            NaN     Tony   Stark
5               Cap@avenge.com            NaN    Steve  Rogers

In [69]:
df = df.append(df2, ignore_index=True)

In [70]:
df

                         email      full_name    first    last
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh   gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro    garg
2         shubham786@gmail.com  shubham singh  shubham   singh
3           corner@esports.com   shivam deshu   shivam   deshu
4           IronMan@avenge.com            NaN     Tony   Stark
5               Cap@avenge.com            NaN    Steve  Rogers

In [71]:
df = df.append({'first': 'Vaibhav', 'last': 'Gupta', 'email': 'vaibhav@gmail.com'}, ignore_index=True)

In [72]:
df

                         email      full_name    first    last
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh   gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro    garg
2         shubham786@gmail.com  shubham singh  shubham   singh
3           corner@esports.com   shivam deshu   shivam   deshu
4           IronMan@avenge.com            NaN     Tony   Stark
5               Cap@avenge.com            NaN    Steve  Rogers
6            vaibhav@gmail.com            NaN  Vaibhav   Gupta

In [73]:
df.drop(5) # or df.drop(index=5)

                         email      full_name    first   last
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh  gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro   garg
2         shubham786@gmail.com  shubham singh  shubham  singh
3           corner@esports.com   shivam deshu   shivam  deshu
4           IronMan@avenge.com            NaN     Tony  Stark
6            vaibhav@gmail.com            NaN  Vaibhav  Gupta

In [74]:
df

                         email      full_name    first    last
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh   gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro    garg
2         shubham786@gmail.com  shubham singh  shubham   singh
3           corner@esports.com   shivam deshu   shivam   deshu
4           IronMan@avenge.com            NaN     Tony   Stark
5               Cap@avenge.com            NaN    Steve  Rogers
6            vaibhav@gmail.com            NaN  Vaibhav   Gupta

In [75]:
filt = df['last'] == 'deshu'
df.drop(index=df[filt].index)

                         email      full_name    first    last
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh   gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro    garg
2         shubham786@gmail.com  shubham singh  shubham   singh
4           IronMan@avenge.com            NaN     Tony   Stark
5               Cap@avenge.com            NaN    Steve  Rogers
6            vaibhav@gmail.com            NaN  Vaibhav   Gupta

In [76]:
df

                         email      full_name    first    last
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh   gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro    garg
2         shubham786@gmail.com  shubham singh  shubham   singh
3           corner@esports.com   shivam deshu   shivam   deshu
4           IronMan@avenge.com            NaN     Tony   Stark
5               Cap@avenge.com            NaN    Steve  Rogers
6            vaibhav@gmail.com            NaN  Vaibhav   Gupta

In [77]:
df.sort_values(by='last', ascending=False)

                         email      full_name    first    last
2         shubham786@gmail.com  shubham singh  shubham   singh
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh   gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro    garg
3           corner@esports.com   shivam deshu   shivam   deshu
4           IronMan@avenge.com            NaN     Tony   Stark
5               Cap@avenge.com            NaN    Steve  Rogers
6            vaibhav@gmail.com            NaN  Vaibhav   Gupta

In [78]:
df.sort_values(by=['last', 'full_name'], ascending=False)

                         email      full_name    first    last
2         shubham786@gmail.com  shubham singh  shubham   singh
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh   gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro    garg
3           corner@esports.com   shivam deshu   shivam   deshu
4           IronMan@avenge.com            NaN     Tony   Stark
5               Cap@avenge.com            NaN    Steve  Rogers
6            vaibhav@gmail.com            NaN  Vaibhav   Gupta

In [79]:
df.sort_values(by=['last', 'full_name'], ascending=[False, True])

                         email      full_name    first    last
2         shubham786@gmail.com  shubham singh  shubham   singh
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh   gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro    garg
3           corner@esports.com   shivam deshu   shivam   deshu
4           IronMan@avenge.com            NaN     Tony   Stark
5               Cap@avenge.com            NaN    Steve  Rogers
6            vaibhav@gmail.com            NaN  Vaibhav   Gupta

In [80]:
df.sort_index()

                         email      full_name    first    last
0  gupta.rishabh2912@gmail.com  Rishabh gupta  Rishabh   gupta
1        garg.shelvi@gmail.com     Paaro garg    Paaro    garg
2         shubham786@gmail.com  shubham singh  shubham   singh
3           corner@esports.com   shivam deshu   shivam   deshu
4           IronMan@avenge.com            NaN     Tony   Stark
5               Cap@avenge.com            NaN    Steve  Rogers
6            vaibhav@gmail.com            NaN  Vaibhav   Gupta

In [81]:
df['last'].sort_values()

6     Gupta
5    Rogers
4     Stark
3     deshu
1      garg
0     gupta
2     singh
Name: last, dtype: object

In [82]:
import numpy as np # For Missing Data

In [88]:
people = {
    'first': ['Rishabh', 'Shevi', 'Shubham', 'Shivam', np.nan, None, 'NA'],
    'last': ['Gupta', 'Garg', 'Singh', 'Deshwal', np.nan, np.nan, 'Missing'],
    'email': ['gupta.rishabh2912@gmail.com', 'smileshelvi@gmail.com', 'shubham@gmail.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['25', '24', '24', '25', None, None, 'Missing']
}

In [108]:
df = pd.DataFrame(people)

df.replace({'NA': np.nan, 'Missing': np.nan}, inplace=True)
df

     first     last                        email   age
0  Rishabh    Gupta  gupta.rishabh2912@gmail.com    25
1    Shevi     Garg        smileshelvi@gmail.com    24
2  Shubham    Singh            shubham@gmail.com    24
3   Shivam  Deshwal                         None    25
4      NaN      NaN                          NaN  None
5     None      NaN          Anonymous@email.com  None
6      NaN      NaN                          NaN   NaN

In [101]:
df.dropna()

     first   last                        email age
0  Rishabh  Gupta  gupta.rishabh2912@gmail.com  25
1    Shevi   Garg        smileshelvi@gmail.com  24
2  Shubham  Singh            shubham@gmail.com  24

In [102]:
df.dropna(axis='index', how='any') #default arguments

     first   last                        email age
0  Rishabh  Gupta  gupta.rishabh2912@gmail.com  25
1    Shevi   Garg        smileshelvi@gmail.com  24
2  Shubham  Singh            shubham@gmail.com  24

In [109]:
df.dropna(axis='index', how='all') # how='all' uses any index which have all missing values

     first     last                        email   age
0  Rishabh    Gupta  gupta.rishabh2912@gmail.com    25
1    Shevi     Garg        smileshelvi@gmail.com    24
2  Shubham    Singh            shubham@gmail.com    24
3   Shivam  Deshwal                         None    25
5     None      NaN          Anonymous@email.com  None

In [104]:
df.dropna(axis='columns', how='any')
#like 4 row have all missing values so result is empty

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [110]:
df.dropna(axis='index', how='any', subset=['email'])

     first   last                        email   age
0  Rishabh  Gupta  gupta.rishabh2912@gmail.com    25
1    Shevi   Garg        smileshelvi@gmail.com    24
2  Shubham  Singh            shubham@gmail.com    24
5     None    NaN          Anonymous@email.com  None

In [111]:
df.dropna(axis='index', how='any', subset=['last', 'email'])

     first   last                        email age
0  Rishabh  Gupta  gupta.rishabh2912@gmail.com  25
1    Shevi   Garg        smileshelvi@gmail.com  24
2  Shubham  Singh            shubham@gmail.com  24

In [112]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

     first     last                        email   age
0  Rishabh    Gupta  gupta.rishabh2912@gmail.com    25
1    Shevi     Garg        smileshelvi@gmail.com    24
2  Shubham    Singh            shubham@gmail.com    24
3   Shivam  Deshwal                         None    25
5     None      NaN          Anonymous@email.com  None

In [113]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [114]:
df.fillna('MISSING')

     first     last                        email      age
0  Rishabh    Gupta  gupta.rishabh2912@gmail.com       25
1    Shevi     Garg        smileshelvi@gmail.com       24
2  Shubham    Singh            shubham@gmail.com       24
3   Shivam  Deshwal                      MISSING       25
4  MISSING  MISSING                      MISSING  MISSING
5  MISSING  MISSING          Anonymous@email.com  MISSING
6  MISSING  MISSING                      MISSING  MISSING

In [115]:
df.fillna(0)

     first     last                        email age
0  Rishabh    Gupta  gupta.rishabh2912@gmail.com  25
1    Shevi     Garg        smileshelvi@gmail.com  24
2  Shubham    Singh            shubham@gmail.com  24
3   Shivam  Deshwal                            0  25
4        0        0                            0   0
5        0        0          Anonymous@email.com   0
6        0        0                            0   0

In [116]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [117]:
df['age'].mean() # age datatype is String in here

TypeError: can only concatenate str (not "int") to str

In [118]:
type(np.nan)

float

In [122]:
#(df['age'] = df['age'].astype(int))
# giving error (int() argument must be a string, a bytes-like object or a number, not 'NoneType')
# typecast in float as missing values will remain misssing
df['age'] = df['age'].astype(float)

In [123]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [124]:
df['age'].mean()

24.5

In [ ]:
#df.astype() to convert all datatype at once